[
  {
    "id": 10,
    "title": "El regreso del HTML semántico",
    "content": "En la era de los frameworks, muchos olvidan que el HTML semántico sigue siendo la base de la accesibilidad y el SEO. Aquí te muestro cómo mejorar tu estructura con etiquetas olvidadas como <figure>, <mark> o <aside>, y por qué tu futuro yo te lo va a agradecer.",
    "author": "jenn",
    "date": "6/8/2025",
    "likes": 3,
    "likedBy": []
  },
  {
    "id": 11,
    "title": "Cómo optimizar imágenes sin perder calidad",
    "content": "Las imágenes son responsables de la mayoría del peso en un sitio web. Te enseño trucos con formatos modernos como WebP y AVIF, lazy loading y compresión inteligente para que tu web cargue como rayo sin sacrificar estética.",
    "author": "userTest",
    "date": "6/8/2025",
    "likes": 4,
    "likedBy": []
  },
  {
    "id": 12,
    "title": "Mi primer error fatal en producción (y cómo sobreviví)",
    "content": "Todos tenemos ese momento de 'lo rompí todo'. Te cuento la vez que un pequeño cambio en el backend tumbó toda la app... y lo que aprendí sobre backups, logs y no confiarme demasiado.",
    "author": "ImagenTest",
    "date": "5/8/2025",
    "likes": 5,
    "likedBy": []
  },
  {
    "id": 13,
    "title": "La magia de las animaciones con CSS",
    "content": "No necesitas JavaScript para animar elementos increíbles. Con `@keyframes`, `transform` y `clip-path` puedes lograr efectos que harán que tu interfaz se sienta viva y fluida.",
    "author": "jenn",
    "date": "5/8/2025",
    "likes": 6,
    "likedBy": []
  },
  {
    "id": 14,
    "title": "Dark patterns: el lado oscuro del UX",
    "content": "Algunos diseñadores usan trucos visuales para manipular al usuario. Analizamos ejemplos reales y cómo evitarlos si quieres mantener un producto ético y centrado en la confianza.",
    "author": "userTest",
    "date": "4/8/2025",
    "likes": 4,
    "likedBy": []
  },
  {
    "id": 15,
    "title": "Por qué TypeScript salvó mi cordura",
    "content": "Pasé de debuggear bugs imposibles a detectar errores antes de ejecutar el código. Te cuento cómo TypeScript se volvió parte esencial de mi stack y por qué creo que todo dev debería al menos probarlo.",
    "author": "jenn",
    "date": "4/8/2025",
    "likes": 5,
    "likedBy": []
  },
  {
    "id": 16,
    "title": "Microinteracciones: pequeños detalles, gran impacto",
    "content": "Desde un botón que vibra al darle click hasta un icono que cambia suavemente, las microinteracciones mejoran la experiencia del usuario y hacen que tu app se sienta cuidada.",
    "author": "ImagenTest",
    "date": "3/8/2025",
    "likes": 3,
    "likedBy": []
  },
  {
    "id": 17,
    "title": "API REST vs GraphQL: mi experiencia real",
    "content": "Probé ambos para el mismo proyecto y descubrí cuándo GraphQL brilla y cuándo REST sigue siendo la opción más simple. Spoiler: no hay bala de plata.",
    "author": "userTest",
    "date": "3/8/2025",
    "likes": 6,
    "likedBy": []
  },
  {
    "id": 18,
    "title": "Diseño accesible: más allá de los colores",
    "content": "La accesibilidad no es solo contraste de color. Hablemos de ARIA roles, navegación por teclado y descripciones alternativas que realmente ayuden.",
    "author": "jenn",
    "date": "2/8/2025",
    "likes": 5,
    "likedBy": []
  },
  {
    "id": 19,
    "title": "Lo que nadie te dice sobre freelancing en tech",
    "content": "Trabajar por tu cuenta suena increíble, pero hay retos invisibles: clientes difíciles, pagos atrasados, y la soledad laboral. Aquí mi visión honesta después de un año en esto.",
    "author": "userTest",
    "date": "2/8/2025",
    "likes": 4,
    "likedBy": []
  },
  {
    "id": 20,
    "title": "Mi setup de escritorio para codear horas sin morir",
    "content": "Desde una buena silla hasta la iluminación correcta, estos ajustes han hecho que pueda trabajar más tiempo sin dolor de espalda ni fatiga visual.",
    "author": "ImagenTest",
    "date": "1/8/2025",
    "likes": 7,
    "likedBy": []
  },
  {
    "id": 21,
    "title": "Cuando usar un framework CSS y cuando no",
    "content": "Tailwind, Bootstrap, Bulma... ¿realmente los necesitas? Te explico en qué proyectos un framework te salva tiempo y en cuáles es mejor ir con CSS puro.",
    "author": "jenn",
    "date": "1/8/2025",
    "likes": 5,
    "likedBy": []
  },
  {
    "id": 22,
    "title": "El arte de nombrar variables",
    "content": "Un buen nombre de variable ahorra más tiempo que cualquier comentario. Hablemos de convenciones, contextos y cómo evitar el mítico 'data' para todo.",
    "author": "userTest",
    "date": "31/7/2025",
    "likes": 6,
    "likedBy": []
  },
  {
    "id": 23,
    "title": "5 extensiones de VSCode que cambiaron mi workflow",
    "content": "Desde Prettier hasta Live Server, estas extensiones han hecho que codear sea más rápido, ordenado y hasta divertido.",
    "author": "jenn",
    "date": "31/7/2025",
    "likes": 5,
    "likedBy": []
  },
  {
    "id": 24,
    "title": "Aprendiendo a testear sin odiarlo",
    "content": "Escribir tests parece tedioso, pero entender herramientas como Jest o Vitest me ayudó a verlos como un aliado que me ahorra dolores de cabeza en producción.",
    "author": "ImagenTest",
    "date": "30/7/2025",
    "likes": 4,
    "likedBy": []
  }
]
